export const drugReportHeaders = [
  {
    id: 1,
    title: "Наименование продукции",
  },
  {
    id: 2,
    title: "Серия",
  },
  {
    id: 3,
    title: "Годен до",
  },
  {
    id: 4,
    title: "Единицы учета",
  },
  {
    id: 5,
    title: "Упак. на нач. отчет. периода",
  },
  {
    id: 6,
    title: "Ед. учета на нач. отчет. периода",
  },
  {
    id: 7,
    title: "Упак. получено за отчет. период",
  },
  {
    id: 8,
    title: "Ед. учета получено за отчет. период",
  },
  {
    id: 9,
    title: "Упак. израсход. за отчет. период",
  },
  {
    id: 10,
    title: "Ед. учета израсход. за отчет. период",
  },
  {
    id: 11,
    title: "Обработано, подвергнуто диагностическим исследованиям голов",
  },
  {
    id: 12,
    title: "Ед. учета утилиз-но. за отчет. период",
  },
  {
    id: 13,
    title: "Ед. учета расход-утилиз. за отчет. период",
  },
  {
    id: 14,
    title: "Упак. на конец отчет. периода",
  },
  {
    id: 15,
    title: "Ед. учета на конец отчет. периода",
  },
];
