export const drugReceiptHeaders = [
  "Наименование продукции",
  "Серия",
  "Контроль",
  "Дата изготовления",
  "Количество упаковок",
  "Количество единиц учета",
];

export const drugReportHeaders = [
  "Наименование продукции",
  "Серия",
  "Годен до",
  "Единицы учета",
  "Упак. на нач. отчет. периода",
  "Ед. учета на нач. отчет. периода",
  "Упак. получено за отчет. период",
  "Ед. учета получено за отчет. период",
  "Упак. израсход. за отчет. период",
  "Ед. учета израсход. за отчет. период",
  "Обработано, подвергнуто диагностическим исследованиям голов",
  "Ед. учета утилиз-но. за отчет. период",
  "Ед. учета расход-утилиз. за отчет. период",
  "Упак. на конец отчет. периода",
  "Ед. учета на конец отчет. периода",
];

export const diagnosticHeaders = [
  "Вид животных",
  "Наименование болезни",
  "№ строки",
  "Исследовано животных (голов)",
  "Реагировало положительно"
]

export const vaccinationHeaders = [
  "Вид животных",
  "Наименование болезни",
  "№ строки",
  "Обработано всего (голов)",
]

export const animalListHeaders = [
  "№ п/п",
  "Вид животного",
  "Кличка",
  "Инвентарный номер",
  "Возраст",
  "t тела",
  "Расход тыс. доз на голову",
  "Подпись владельца"
]
