import { DISEASES, WORKTYPES } from "shared/constants/vetworkConst";

export const drugReceiptHeaders = [
  "Наименование продукции",
  "Ед. учета",
  "Серия",
  "Контроль",
  "Дата изготовления",
  "Количество упаковок",
  "Количество единиц учета",
];

export const catalogDrugMovementHeaders = [
  "Дата операции",
  "Количество упаковок",
  "Количество единиц учета",
];

export const drugReportHeaders = [
  "Наименование продукции",
  "Серия",
  "Годен до",
  "Единицы учета",
  "Упак. на нач. отчет. периода",
  "Ед. учета на нач. отчет. периода",
  "Упак. получено за отчет. период",
  "Ед. учета получено за отчет. период",
  "Упак. израсход. за отчет. период",
  "Ед. учета израсход. за отчет. период",
  "Обработано, подвергнуто диагностическим исследованиям голов",
  "Ед. учета утилиз-но. за отчет. период",
  "Ед. учета расход-утилиз. за отчет. период",
  "Упак. на конец отчет. периода",
  "Ед. учета на конец отчет. периода",
];

export const diagnosticHeaders = [
  "Вид животных",
  "Наименование болезни",
  "№ строки",
  "Исследовано животных (голов)",
  "Реагировало положительно",
];

export const vaccinationHeaders = [
  "Вид животных",
  "Наименование болезни",
  "№ строки",
  "Обработано всего (голов)",
];

export const animalListHeaders = [
  "№ п/п",
  "Вид животного",
  "Кличка",
  "Инвентарный номер",
  "Возраст",
  "t тела",
  "Расход тыс. доз на голову",
  "Подпись владельца",
];

export const companyAnimalsHeaders = [
  "Вид животного",
  "Пол животного",
  "Дата рождения",
  "",
  "Кличка",
  "",
  "Идентификация",
  "",
  "",
];

export const companyEmployeesHeaders = [
  "Должность",
  "Фамилия",
  "Имя",
  "Отчество",
  "",
];

export const animalInVetWorkHeaders = (workType: string, disease: string) => {
  let headers = [];

  if (workType === WORKTYPES.vaccination) {
    headers = [
      "Вид животного",
      "Пол животного",
      "Дата рождения",
      "Кличка",
      "Идентификация",
      "Дозировка",
      "",
      "",
    ];
    return headers;
  }

  if (workType === WORKTYPES.treatment) {
    headers = [
      "Вид животного",
      "Пол животного",
      "Дата рождения",
      "Кличка",
      "Идентификация",
      "Дозировка",
      "",
      "",
    ];
    return headers;
  }

  if (workType === WORKTYPES.diagnostic && disease === DISEASES.tbc) {
    headers = [
      "Вид животного",
      "Пол животного",
      "Дата рождения",
      "Кличка",
      "Идентификация",
      "Дозировка",
      "",
      "Результат исследования",
      "",
      "",
    ];
    return headers;
  }

  headers = [
    "Вид животного",
    "Пол животного",
    "Дата рождения",
    "Кличка",
    "Идентификация",
    "Результат исследования",
    "",
    "",
  ];
  return headers;
};

export const referralAnimalsHeaders = [
  "№ п/п",
  "Вид животного",
  "Инвентарный номер/ кличка",
  "Пол",
  "Возраст",
  "Шифр пробы",
  "Результат исследования",
];
